/* เจ้าของรถคันหนึ่งสังเกตว่าเขาขับรถของเขาไปได้ไกล 300 กิโลเมตร โดยใช้น้ำมัน 20 ลิตร เขา
 * อยากทราบว่ารถของเขากินน้ำมันกี่กิโลลิตร (กิโลเมตรต่อลิตร) ให้เขียนโปรแกรม เพื่อคำนวณ
 * อัตราการใช้น้ำมันของรถคันนั้น
 * จัดทำวันที่ 7/25/2023
 */
public class PuripongClass3_4_6 {
    public static void main(String[] args) {
        int car = 300;
        int fuse = 20;

        int carandfuse = car / fuse;

        System.out.println("รถของเขากินน้ำมัน " + carandfuse + " กิโลเมตรต่อลิตร");
    }
}
